app/Models/AccountModel.php

SELECT *
FROM "account"
WHERE "email" = 'progavanceeemail@gmail.com'
 LIMIT 1
---
	public function getAccountByEmail($email)
	{
		return $this->where('email', $email)->first();