app/Models/TaskModel.php

    public function getTasksByDateRange($startDate, $days, $idAccount)
    {
        $days = $days - 1;
        $endDate = date('Y-m-d', strtotime("$startDate +$days days")); // Calcul de la date de fin

        // Récupérer toutes les tâches dont les dates chevauchent la plage demandée
        $tasks = $this->where("id_account", $idAccount)
            ->groupStart()
            ->where("start_date <=", $endDate)
            ->where("end_date >=", $startDate)
            ->groupEnd()
            ->orGroupStart()
            ->where("end_date", null) // Date de fin non définie
            ->where("current_state", 'in_progress') // Tâche en cours
            ->groupEnd()
            ->findAll();
---
SELECT *
FROM "task"
WHERE "id_account" IS NULL
AND   (
"start_date" <= '2024-12-04'
AND "end_date" >= '2024-11-27'
 )
OR   (
"end_date" IS NULL
AND "current_state" = 'in_progress'
 )

    public function getTasksByPriority($idAccount)
    {
        $result = [];

        for ($i = 4; $i > 0; $i--) {

            $tasks = $this->where("id_account", $idAccount)
                ->where("priority", $i)
                ->orderBy("deadline")
                ->findAll();
---
SELECT *
FROM "task"
WHERE "id_account" = '7'
AND "priority" = 4
ORDER BY "deadline"

    public function getTasksByCurrentState($idAccount)
    {
        $states = ['En retard', 'En cours','Pas commencée', 'Terminée', 'Bloquée'];

        foreach($states as $s) {
            $tasks = $this->where("id_account", $idAccount)
            ->where("current_state", $s)
            ->orderBy("deadline")
            ->findAll();
---
SELECT *
FROM "task"
WHERE "id_account" = '7'
AND "current_state" = 'En retard'
ORDER BY "deadline"

    public function getTasksByDeadline($startDate, $days, $idAccount)
    {
        // Initialiser les dates dans le tableau associatif
        for ($i = 0; $i <= $days; $i++) {
            $currentDate = date('Y-m-d', strtotime("$startDate +$i days"));
            $currentDateHour = date('Y-m-d H:i:s', strtotime("$startDate +$i days"));

            $tasks = $this->where("id_account", $idAccount)
                ->where("deadline", $currentDateHour)
                ->orderBy('priority', 'DESC')
                ->findAll();
---
SELECT *
FROM "task"
WHERE "id_account" = '7'
AND "deadline" = '2024-11-27 00:00:00'
ORDER BY "priority" DESC